# DWGExportOptions Constructor (DWGExportOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGExportOptions Constructor (DWGExportOptions)
DWGExportOptions Class See Also
---
Constructs a new instance of DWGExportOptions as a copy of the export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWGExportOptions(
	DWGExportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As DWGExportOptions _
)
```

Visual C++
---
```text
public:
DWGExportOptions(
	DWGExportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..DWGExportOptions The options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DWGExportOptions Class
DWGExportOptions Overload
Autodesk.Revit.DB Namespace